posts/2019-07-02-writing-a-background-worker-for-cisco-nso.org
#+TITLE: Writing a Python background worker for Cisco NSO
#+AUTHOR: Kristian Larsson
#+EMAIL: kristian@spritelink.net
#+DATE: <2019-07-25 00:00:00>
#+LANGUAGE: en
#+FILETAGS: NSO
#+OPTIONS: toc:nil num:3 H:4 ^:nil pri:t
#+OPTIONS: html-style:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/org.css"/>

* Writing a Python background worker for Cisco NSO
  The ~create()~ callback is the primary means of which we get things done in Cisco NSO. NSO is most often used for configuration provisioning and so the ~create()~ callback, which reacts to changes on a YANG configuration subtree is the perfect tool; new configuration input leads to running of our ~create()~ code which renders new configuration output that we can push to devices or other services. In the YANG model we use a ~servicepoints~ for attaching a ~create()~ callback to a particular subtree in the YANG model. In addition to ~create()~ ~servicepoint~ we also have ~actionpoints~ which allow us to attach our code to YANG actions. Both ~servicepoint~ and ~actionpoint~ both attach to the YANG model and lets code be executed upon external stimuli, either the request to run an action or the change of configuration. What if you want to decide yourself when something should happen or perhaps execute things at a certain periodicity? That's a job for a background worker which is running continuously. With such a background worker, it would be entirely up to you to shape and form the code of the worker to do whatever you need to accomplish. This post is about implementing such a background worker.
   
  It should be noted that there is functionality in NSO to schedule periodic activities in a cron job style but I find it somewhat lacking, not that it's worse than cron but cron just isn't the right tool for everything. You would probably do well in understanding it before deciding on how to solve your specific challenge. Either way, as is common with us technical people the question of why or why not is not the focus of this post. Rather, we want to focus on the *how*. /If/ you feel the need for a background worker in NSO, how do you actually go about implementing one?
   
  I'll assume you have some experience with Cisco NSO and that you know how to implement basic services, actions etc. Since I have a strong preference of Python over Java, this will focus on how to do this using the Python support in NSO. Let's go on a journey of implementing a Python background worker for Cisco NSO!
   
** TL;DR;
   If you just want to skip to the result, check out [[https://github.com/plajjan/bgworker][bgworker on github]].

** Anatomy of the Python VM
   The NSO core is written in Erlang and so to run user code written in Python it runs a separate Python VM process that communicates with the NSO core over a number of APIs. It will spawn one Python VM process for each NSO package that wants to run Python code. Thus there is some separation between different packages and given the GIL (Giant Interpreter Lock) in the standard Python interpreter it also allows for a natural way to get past the parallel execution problem, at least to a certain extent, as different NSO packages will run in their own python process.
    
   Within each Python VM there will be a main thread and then multiple other threads for the various components that are specified by the ~package-meta-data.xml~ file.
    
