2019-07-25-writing-a-background-worker-for-cisco-nso.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://plajjan.github.io/rss.xml"
      title="RSS feed for https://plajjan.github.io/"/>
<title>Writing a Python background worker for Cisco NSO</title>
<meta name="author" content="Kristian Larsson">
<meta name="referrer" content="no-referrer">
<link href= "css/style.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
</head>
<body>
<div id="preamble" class="status">
<div class='header'>
  <a href='/'>Network Automation ramblings by Kristian Larsson</a>
</div>
<nav style='float: right; display: block;'>
<a href='/'>Blog</a>
<a href='/tools.html'>Tools</a>
<a href='/about.html'>About</a>
</nav></div>
<div id="content">
<div class="post-date">25 Jul 2019</div><h1 class="post-title"><a href="2019-07-25-writing-a-background-worker-for-cisco-nso.html">Writing a Python background worker for Cisco NSO</a></h1>

<div id="outline-container-org9bf29f6" class="outline-2">
<h2 id="org9bf29f6"><span class="section-number-2">1</span> Writing a Python background worker for Cisco NSO</h2>
<div class="outline-text-2" id="text-1">
<p>
The <code>create()</code> callback is the primary means of which we get things done in Cisco NSO. NSO is most often used for configuration provisioning and so the <code>create()</code> callback, which reacts to changes on a YANG configuration subtree is the perfect tool; new configuration input leads to running of our <code>create()</code> code which renders new configuration output that we can push to devices or other services. In the YANG model we use a <code>servicepoints</code> for attaching a <code>create()</code> callback to a particular subtree in the YANG model. In addition to <code>create()</code> <code>servicepoint</code> we also have <code>actionpoints</code> which allow us to attach our code to YANG actions. Both <code>servicepoint</code> and <code>actionpoint</code> attach to the YANG model and lets code be executed upon external stimuli, either the request to run an action or the change of configuration. What if you want to decide yourself when something should happen or perhaps execute things at a certain periodicity? That's a job for a background worker which is running continuously. With such a background worker, it would be entirely up to you to shape and form the code of the worker to do whatever you need to accomplish. This post is about implementing such a background worker.
</p>

<p>
It should be noted that there is functionality in NSO to schedule periodic activities in a cron job style but I find it somewhat lacking, not that it's worse than cron but cron just isn't the right tool for everything. You would probably do well in understanding it before deciding on how to solve your specific challenge. Either way, as is common with us technical people the question of why or why not is not the focus of this post. Rather, we want to focus on the <b>how</b>. <i>If</i> you feel the need for a background worker in NSO, how do you actually go about implementing one?
</p>

<p>
I'll assume you have some experience with Cisco NSO and that you know how to implement basic services, actions etc. Since I have a strong preference of Python over Java, this will focus on how to do this using the Python support in NSO. Let's go on a journey of implementing a Python background worker for Cisco NSO!
</p>
</div>

<div id="outline-container-org7389e34" class="outline-3">
<h3 id="org7389e34"><span class="section-number-3">1.1</span> TL;DR;</h3>
<div class="outline-text-3" id="text-1-1">
<p>
If you just want to skip to the result, check out <a href="https://github.com/plajjan/bgworker">bgworker on github</a>.
</p>
</div>
</div>

<div id="outline-container-org55f29ac" class="outline-3">
<h3 id="org55f29ac"><span class="section-number-3">1.2</span> Anatomy of the Python VM</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The NSO core is written in Erlang and so to run user code written in Python it runs a separate Python VM process that communicates with the NSO core over a number of APIs. It will spawn one Python VM process for each NSO package that wants to run Python code. Thus there is some separation between different packages and given the GIL (Giant Interpreter Lock) in the standard Python interpreter it also allows for a natural way to get past the parallel execution problem, at least to a certain extent, as different NSO packages will run in their own python process.
</p>

<p>
Within each Python VM there will be a main thread and then multiple other threads for the various components that are specified by the <code>package-meta-data.xml</code> file.
</p>
</div>
</div>
