posts/2019-07-02-writing-a-background-worker-for-cisco-nso.org
** A naive approach
   Okay, so let's get started. Let's try writing a background worker. We'll start by making a new package and we'll start off from the python service skeleton.
    
   #+BEGIN_SRC shell
     ncs-make-package --service-skeleton python
   #+END_SRC
    
   The purpose of our background worker, as an example, will be to increment a counter at a periodic interval. It's stupid simple and not useful on its own but as we will see, our focus won't be on the work carried out but primarily on the things around setting up a worker and so this will serve as a simple example. I'm sure you'll be able to adapt it to your task.

   Edit or replace the YANG model to the following. We just want a simple leaf called counter, that is config false (i.e. operational state data). To avoid total chaos we put it under a bgworker container.
    
   #+BEGIN_SRC yang
     module bgworker {

       namespace "http://example.com/bgworker";
       prefix bgworker;

       container bgworker {
         leaf counter {
           config false;
           type uint32;
           default 0;
         }
       }
     }
   #+END_SRC

   There are some other things, like revision and description of the module that you should add in but I'm trying to keep it to an absolute bare minimum in order to focus on what is relevant for our scenario.
    
   We set the default value to 0 which means the counter will be 0 each time NCS starts up. Unlike configuration data, state data in NCS is not persisted per default which is why our leaf will go back to a value of 0 each time NCS starts. We could add ~tailf:persistent "true"~ to the leaf to make it persisted in CDB.
    
   With a YANG model in place, how do we actually go about implementing the worker itself? The ~ncs.application.Application~ class offered by the NSO Python libraries allows us to define an "Application" which is our entry point and way of hooking into NSO. The normal example skeleton code produced by ~ncs-make-package~ shows us the use of the ~setup()~ and ~teardown()~ methods to hook into the start and stop of our Application.
    
   #+BEGIN_SRC python
     # -*- mode: python; python-indent: 4 -*-
     import ncs
     from ncs.application import Service


     # ------------------------
     # SERVICE CALLBACK EXAMPLE
     # ------------------------
     class ServiceCallbacks(Service):

         # The create() callback is invoked inside NCS FASTMAP and
         # must always exist.
         @Service.create
         def cb_create(self, tctx, root, service, proplist):
             self.log.info('Service create(service=', service._path, ')')


         # The pre_modification() and post_modification() callbacks are optional,
         # and are invoked outside FASTMAP. pre_modification() is invoked before
         # create, update, or delete of the service, as indicated by the enum
         # ncs_service_operation op parameter. Conversely
         # post_modification() is invoked after create, update, or delete
         # of the service. These functions can be useful e.g. for
         # allocations that should be stored and existing also when the
         # service instance is removed.

         # @Service.pre_lock_create
         # def cb_pre_lock_create(self, tctx, root, service, proplist):
         #     self.log.info('Service plcreate(service=', service._path, ')')

         # @Service.pre_modification
         # def cb_pre_modification(self, tctx, op, kp, root, proplist):
         #     self.log.info('Service premod(service=', kp, ')')

         # @Service.post_modification
         # def cb_post_modification(self, tctx, op, kp, root, proplist):
         #     self.log.info('Service premod(service=', kp, ')')


     # ---------------------------------------------
     # COMPONENT THREAD THAT WILL BE STARTED BY NCS.
     # ---------------------------------------------
     class Main(ncs.application.Application):
         def setup(self):
             # The application class sets up logging for us. It is accessible
             # through 'self.log' and is a ncs.log.Log instance.
             self.log.info('Main RUNNING')

             # Service callbacks require a registration for a 'service point',
             # as specified in the corresponding data model.
             #
             self.register_service('bgworker-servicepoint', ServiceCallbacks)

             # If we registered any callback(s) above, the Application class
             # took care of creating a daemon (related to the service/action point).

             # When this setup method is finished, all registrations are
             # considered done and the application is 'started'.

         def teardown(self):
             # When the application is finished (which would happen if NCS went
             # down, packages were reloaded or some error occurred) this teardown
             # method will be called.

             self.log.info('Main FINISHED')
   #+END_SRC
    
   As can be seen by this comment, this is a component thread and runs as a thread in the Python VM.
    
   #+BEGIN_SRC python
     # ---------------------------------------------
     # COMPONENT THREAD THAT WILL BE STARTED BY NCS.
     # ---------------------------------------------
     class Main(ncs.application.Application):
         def setup(self):
             ...
   #+END_SRC
    
   We want a background worker, so all we have to do is start another thread from this ~setup()~ method, right?
    
   Here's the modified Python code:
   #+BEGIN_SRC python
     # -*- mode: python; python-indent: 4 -*-
     import threading
     import time

     import ncs
     from ncs.application import Service


     class BgWorker(threading.Thread):
         def run(self):
             while True:
                 print("Hello from background worker")
                 time.sleep(1)


     class Main(ncs.application.Application):
         def setup(self):
             self.log.info('Main RUNNING')
             self.bgw = BgWorker()
             self.bgw.start()

         def teardown(self):
             self.log.info('Main FINISHED')
             self.bgw.stop()
   #+END_SRC
    
   I ripped out the ~ServiceCallbacks~ class with its ~cb_create()~ since we don't need that here and instead created a new thread definition called ~BgWorker~ which is instantiated and started from the ~setup()~ method of our Application. Let's try loading the package by running ~request packages reload~ on our NCS instance (I'm presuming you know how to start up NCS, put the package in the right place etc).
    
   #+BEGIN_SRC text
     admin@ncs> request packages reload force

     >>> System upgrade is starting.
     >>> Sessions in configure mode must exit to operational mode.
     >>> No configuration changes can be performed until upgrade has completed.
     >>> System upgrade has completed successfully.
     reload-result {
         package bgworker
         result true
     }
     [ok][2019-07-01 13:43:04]
     admin@ncs>
   #+END_SRC
    
   The only thing our background worker does at this point is print a message once a second. Since they are printed and not logged, they will show up in the main python log of NCS ~ncs-python-vm.log~. 
    
   #+BEGIN_SRC text
     kll@nuc:~/ncs-4.7.4.2/ncs-run/logs$ tail -f ncs-python-vm.log 
     <INFO> 1-Jul-2019::13:43:04.534 nuc ncs[11832]: Started PyVM: <<"bgworker">> , Port=#Port<0.26560> , OSpid="26111"
     <INFO> 1-Jul-2019::13:43:04.535 nuc ncs[11832]: bgworker :: Starting /home/kll/ncs-4.7.4.2/src/ncs/pyapi/ncs_pyvm/startup.py -l info -f ./logs/ncs-python-vm -i bgworker
     <INFO> 1-Jul-2019::13:43:04.595 nuc ncs[11832]: bgworker :: Hello from background worker
     <INFO> 1-Jul-2019::13:43:05.597 nuc ncs[11832]: bgworker :: Hello from background worker
     <INFO> 1-Jul-2019::13:43:06.598 nuc ncs[11832]: bgworker :: Hello from background worker
     <INFO> 1-Jul-2019::13:43:07.599 nuc ncs[11832]: bgworker :: Hello from background worker
     <INFO> 1-Jul-2019::13:43:08.599 nuc ncs[11832]: bgworker :: Hello from background worker
   #+END_SRC
    
   Et voilà! It's working.
    
