posts/2019-07-02-writing-a-background-worker-for-cisco-nso.org
** Reacting to NCS package events like reload and redeploy
   ~request packages reload~ is the "standard" way of loading in new packages, including loading new packages, loading a newer version of an existing already loaded package as well as unloading package (in which case you have to also provide the ~force~ as NCS will complain over the removal of a namespace, which it thinks is a mistake). It covers all changes like config template changes, YANG model changes and code changes. It is however quite slow and if you have a lot of packages you will soon be rather annoyed over the time it takes (around 2 minutes with the packages we usually have loaded in my work environment). Code changes are perhaps the most common changes during development as you are changing lines, wanting to get them loaded immediately and then run your code again. There is a ~redeploy~ command for exactly this purpose which can redeploy the code for a single package. In our case, the package is called ~bgworker~ and so we can redeploy the code by running ~request packages package bgworker redeploy~. It normally runs in a second or so.
    
   Let's try:
   #+BEGIN_SRC text
     admin@ncs> request packages package bgworker redeploy
     result false
     [ok][2019-07-01 13:48:49]
     admin@ncs> 
   #+END_SRC
    
   uh oh. ~result false~, why?

   Well, our thread runs a ~while True~ loop and so it simply doesn't have a way of exiting. Unlike UNIX processes, there is no way to kill a thread. They can't be interrupted through signals or similar. If you want to stop a thread, the thread itself has to cooperate, so in effect what you are doing is to /ask/ the thread to shut down. We can still forcibly stop our thread by stopping the entire Python VM for our NCS package, since it is running as a UNIX process and can thus be terminated, which will naturally bring down the thread as well. There is a ~request python-vm stop~ command in NCS or we can just run ~request packages reload~ which also involves restarting the Python VM (restart being a stop of the old version and a start of the new version). 
    
   We want to be able to run ~redeploy~ though, so how do we get our background worker to play nice? The requirement is that the work has to stop within 3 seconds or NCS thinks it's a failure.
    
   Using a Python events might be the most natural way:
    
   #+BEGIN_SRC python
     # -*- mode: python; python-indent: 4 -*-
     import threading
     import time

     import ncs
     from ncs.application import Service


     class BgWorker(threading.Thread):
         def __init__(self):
             threading.Thread.__init__(self)
             self._exit_flag = threading.Event()

         def run(self):
             while not self._exit_flag.wait(timeout=1):
                 print("Hello from background worker")

         def stop(self):
             self._exit_flag.set()
             self.join()


     class Main(ncs.application.Application):
         def setup(self):
             self.log.info('Main RUNNING')
             self.bgw = BgWorker()
             self.bgw.start()

         def teardown(self):
             self.log.info('Main FINISHED')
             self.bgw.stop()
   #+END_SRC
 
   We modify our code a bit, inserting a check on a threading.Event in the main loop and then set the Event externally in the thread ~stop()~ method. Since we can run ~wait()~ on the Event with a timeout of 1 second we no longer need the separate ~time.sleep(1)~ call.
    
   We override ~__init__()~ but since we have to call the overwritten ~__init__~ we do that by calling ~threading.Thread.__init__(self)~.
    
   Now running redeploy works just fine:
    
   #+BEGIN_SRC text
     admin@ncs> request packages package bgworker redeploy               
     result true
     [ok][2019-07-01 15:02:09]
     admin@ncs> 
   #+END_SRC
 
   Maybe we should implement the main functionality of our program, to increment the counter, instead of just printing a message. Let's rewrite the ~run~ method. I've included the full module here but the changes are only in the ~run~ method.
    
   #+BEGIN_SRC python
     # -*- mode: python; python-indent: 4 -*-
     import threading
     import time

     import ncs
     from ncs.application import Service


     class BgWorker(threading.Thread):
         def __init__(self):
             threading.Thread.__init__(self)
             self._exit_flag = threading.Event()

         def run(self):
             while not self._exit_flag.wait(timeout=1):
                 with ncs.maapi.single_write_trans('bgworker', 'system', db=ncs.OPERATIONAL) as oper_trans_write:
                     root = ncs.maagic.get_root(oper_trans_write)
                     cur_val = root.bgworker.counter
                     root.bgworker.counter += 1
                     oper_trans_write.apply()

                 print("Hello from background worker, increment counter from {} to {}".format(cur_val, cur_val+1))

         def stop(self):
             self._exit_flag.set()
             self.join()


     class Main(ncs.application.Application):
         def setup(self):
             self.log.info('Main RUNNING')
             self.bgw = BgWorker()
             self.bgw.start()

         def teardown(self):
             self.log.info('Main FINISHED')
             self.bgw.stop()
   #+END_SRC
    
   # XXX is "context" and "user" correct here or is it the other way around?
   #+BEGIN_SRC python
                       with ncs.maapi.single_write_trans('bgworker', 'system', db=ncs.OPERATIONAL) as oper_trans_write:
   #+END_SRC
   We've added some code where we open a single MAAPI write transaction using ~single_write_trans()~ which allows us to open both a maapi context, session and transaction all in one call. We use it as a context manager to ensure we close all those resources in case of errors or normal exit. There are three parameters to this call. The first and second are the "authentication" information to the system. All of this is running over a trusted MAAPI session but we can tell it what user we are then running our session as. The ~system~ user is special and has access to pretty much everything. It doesn't rely on the AAA system and so it is a good candidate for writing these kinds of background workers - if someone messes up the AAA configuration you still don't risk your background workers stopping. The first parameter is a context name. I've found that it's very useful to use a good name (you can use an empty string) since it makes troubleshooting so much easier - this context name shows up in ~ncs --status~ and other places - if you want to be able to know who is holding a lock, you want to put something useful here. The third parameter is where we say we are only interested in the operational datastore, whereas if we wanted to change any configuration this would have to be ~running~, which also is the default so we could just leave out the argument completely.
    
   Once we have a transaction to the operational database we want to find our node, read out its value, add 1 and write it back which is what the following three lines accomplishes:
    
   #+BEGIN_SRC python
                           root = ncs.maagic.get_root(oper_trans_write)
                           cur_val = root.bgworker.counter
                           root.bgworker.counter += 1
                           oper_trans_write.apply()
   #+END_SRC
    
   finally we ~apply()~ the transaction.

   In the logs we can now see our log message reflecting what it is doing:
    
   #+BEGIN_SRC text
     <INFO> 1-Jul-2019::15:11:54.906 nuc ncs[11832]: Started PyVM: <<"bgworker">> , Port=#Port<0.34116> , OSpid="32328"
     <INFO> 1-Jul-2019::15:11:54.906 nuc ncs[11832]: bgworker :: Starting /home/kll/ncs-4.7.4.2/src/ncs/pyapi/ncs_pyvm/startup.py -l info -f ./logs/ncs-python-vm -i bgworker
     <INFO> 1-Jul-2019::15:11:55.956 nuc ncs[11832]: bgworker :: Hello from background worker, increment counter from 0 to 1
     <INFO> 1-Jul-2019::15:11:56.964 nuc ncs[11832]: bgworker :: Hello from background worker, increment counter from 1 to 2
     <INFO> 1-Jul-2019::15:11:57.977 nuc ncs[11832]: bgworker :: Hello from background worker, increment counter from 2 to 3
     <INFO> 1-Jul-2019::15:11:58.982 nuc ncs[11832]: bgworker :: Hello from background worker, increment counter from 3 to 4
     <INFO> 1-Jul-2019::15:11:59.997 nuc ncs[11832]: bgworker :: Hello from background worker, increment counter from 4 to 5
     <INFO> 1-Jul-2019::15:12:01.007 nuc ncs[11832]: bgworker :: Hello from background worker, increment counter from 5 to 6
   #+END_SRC
    
   And if we go look at the value through the CLI we can see how it is being incremented:
   #+BEGIN_SRC text
     admin@ncs> show bgworker counter 
     bgworker counter 845
     [ok][2019-07-01 15:26:08]
     admin@ncs> 
   #+END_SRC
    
   Success!
 
   If we ~redeploy~ the ~bgworker~ package or reload all packages, the worker would continue incrementing the counter from where it left off. This is because we only restart the Python VM while NCS is still running and since the value is stored in CDB, which is part of NCS, it will not go back to the default value of 0 unless we restart NCS.
    
   Let's clean up our code a bit. Instead of printing these messages to stdout we want to use standard Python logging (well, it's actually overridden by an NCS logging module but it acts the same, just allowing reconfiguration from within NCS itself). We want to hide this background thread and just make it look like our application is printing the messages and so we pass the log object down (you can do it in other ways if you want to):
    
   #+BEGIN_SRC python
     # -*- mode: python; python-indent: 4 -*-
     import threading
     import time

     import ncs
     from ncs.application import Service


     class BgWorker(threading.Thread):
         def __init__(self, log):
             threading.Thread.__init__(self)
             self.log = log
             self._exit_flag = threading.Event()

         def run(self):
             while not self._exit_flag.wait(timeout=1):
                 with ncs.maapi.single_write_trans('bgworker', 'system', db=ncs.OPERATIONAL) as oper_trans_write:
                     root = ncs.maagic.get_root(oper_trans_write)
                     cur_val = root.bgworker.counter
                     root.bgworker.counter += 1
                     oper_trans_write.apply()

                 self.log.info("Hello from background worker, increment counter from {} to {}".format(cur_val, cur_val+1))

         def stop(self):
             self._exit_flag.set()
             self.join()


     class Main(ncs.application.Application):
         def setup(self):
             self.log.info('Main RUNNING')
             self.bgw = BgWorker(log=self.log)
             self.bgw.start()

         def teardown(self):
             self.log.info('Main FINISHED')
             self.bgw.stop()
   #+END_SRC
    
   And looking in the log ~ncs-python-vm-bgworker-log~ (notice the package name ~bgworker~ in the file name) we see how it is now logging there as expected:
    
   #+BEGIN_SRC text
   <INFO> 01-Jul-2019::15:30:06.582 bgworker MainThread: - Python 2.7.16 (default, Apr  6 2019, 01:42:57) [GCC 8.3.0]
   <INFO> 01-Jul-2019::15:30:06.582 bgworker MainThread: - Starting...
   <INFO> 01-Jul-2019::15:30:06.583 bgworker MainThread: - Started
   <INFO> 01-Jul-2019::15:30:06.602 bgworker ComponentThread:main: - Main RUNNING
   <INFO> 01-Jul-2019::15:30:07.607 bgworker Thread-5: - Hello from background worker, increment counter from 1061 to 1062
   <INFO> 01-Jul-2019::15:30:08.620 bgworker Thread-5: - Hello from background worker, increment counter from 1062 to 1063
   <INFO> 01-Jul-2019::15:30:09.624 bgworker Thread-5: - Hello from background worker, increment counter from 1063 to 1064
   <INFO> 01-Jul-2019::15:30:10.628 bgworker Thread-5: - Hello from background worker, increment counter from 1064 to 1065
   #+END_SRC

   (you can also sort of figure out how long I am taking to write the various sections of this post based on the counter).
    
    
