posts/2019-07-02-writing-a-background-worker-for-cisco-nso.org
** Back to killable threads
   Now that we've opened a transaction towards CDB there is one issue we will inevitable face. The running datastore has a global lock and while there are no locks on the operational datastore, applying a transaction can still take some time. For example, in a HA cluster the operational data is synchronously replicated and if other nodes are busy or there are other things ahead of us queued up, it can take some time to apply a transaction. Remember that we have to exit in three seconds. The way we structured our code, we read the ~self._exit_flag~ waiting for up to a second for any values to happen, then we open the transaction and write some data and then we come back to looking at our exit flag again. If we spend more than three seconds in the transaction part of the code we won't observe the exit flag and we will fail to exit in three seconds.
    
   How do we avoid this? How can we leave a guarantee on being able to exit in three seconds?
    
   One solution is to avoid threads altogether and instead use separate processes and this is the route which we will go down. A process can be interrupted by signals like TERM or KILL, which is the functionality we are after here.

   Also, David Beazley did an interesting talk on killable threads https://www.youtube.com/watch?v=U66KuyD3T0M which you're encouraged to check out. It's rather interesting... but back to our background worker process!
    
** multiprocessing
   Python has a very convenient library called ~multiprocessing~ which is close to a drop in replacement for the threading library but as we'll see, we can simplify the code quite a bit since we no longer have to do cooperative shutdown - we can just terminate the background worker process when we want to stop it.
    
   #+BEGIN_SRC python
     # -*- mode: python; python-indent: 4 -*-
     import multiprocessing
     import time

     import ncs
     from ncs.application import Service

     def bg_worker(log):
         while True:
             with ncs.maapi.single_write_trans('bgworker', 'system', db=ncs.OPERATIONAL) as oper_trans_write:
                 root = ncs.maagic.get_root(oper_trans_write)
                 cur_val = root.bgworker.counter
                 root.bgworker.counter += 1
                 oper_trans_write.apply()

             log.info("Hello from background worker process, increment counter from {} to {}".format(cur_val, cur_val+1))
             time.sleep(1)


     class Main(ncs.application.Application):
         def setup(self):
             self.log.info('Main RUNNING')
             self.bgw = multiprocessing.Process(target=bg_worker, args=[self.log])
             self.bgw.start()

         def teardown(self):
             self.log.info('Main FINISHED')
             self.bgw.terminate()
   #+END_SRC
    
   Much simpler, no? And the result is the same, in fact, since we are passing in the logging object, it is inseparable from the threading solution in the log:
    
   #+BEGIN_SRC text
     <INFO> 01-Jul-2019::21:12:42.897 bgworker ComponentThread:main: - Main RUNNING
     <INFO> 01-Jul-2019::21:12:42.905 bgworker ComponentThread:main: - Hello from background worker process, increment counter from 21271 to 21272
     <INFO> 01-Jul-2019::21:12:43.911 bgworker ComponentThread:main: - Hello from background worker process, increment counter from 21272 to 21273
   #+END_SRC
    
   well, I changed the log message slightly so I'd actually see it was from the background worker *process*.
    
