posts/2019-07-02-writing-a-background-worker-for-cisco-nso.org
** Reacting to worker process events
   What happens if something goes wrong with our worker process? Let's try.
    
   #+BEGIN_SRC python
     def bg_worker(log):
         while True:
             with ncs.maapi.single_write_trans('bgworker', 'system', db=ncs.OPERATIONAL) as oper_trans_write:
                 root = ncs.maagic.get_root(oper_trans_write)
                 cur_val = root.bgworker.counter
                 root.bgworker.counter += 1
                 oper_trans_write.apply()

             log.info("Hello from background worker process, increment counter from {} to {}".format(cur_val, cur_val+1))
             if random.randint(0, 9) == 9:
                 raise ValueError("bad dice value")
             time.sleep(1)

   #+END_SRC
    
   so we'll throw our ten sided dice and if we hit 9 we'll throw an error which should lead to termination of the python vm in the background process.
    
   #+BEGIN_SRC text
     kll@nuc:~/ncs-4.7.4.2/ncs-run/logs$ tail -f ncs-python-vm-bgworker.log ncs-python-vm.log 
     ...
     ==> ncs-python-vm-bgworker.log <==
     <INFO> 01-Jul-2019::21:21:56.770 bgworker ComponentThread:main: - Hello from background worker process, increment counter from 21804 to 21805
     <INFO> 01-Jul-2019::21:21:57.783 bgworker ComponentThread:main: - Hello from background worker process, increment counter from 21805 to 21806
     <INFO> 01-Jul-2019::21:21:58.788 bgworker ComponentThread:main: - Hello from background worker process, increment counter from 21806 to 21807
     <INFO> 01-Jul-2019::21:21:59.798 bgworker ComponentThread:main: - Hello from background worker process, increment counter from 21807 to 21808
     <INFO> 01-Jul-2019::21:22:00.807 bgworker ComponentThread:main: - Hello from background worker process, increment counter from 21808 to 21809
     <INFO> 01-Jul-2019::21:22:01.824 bgworker ComponentThread:main: - Hello from background worker process, increment counter from 21809 to 21810
     <INFO> 01-Jul-2019::21:22:02.841 bgworker ComponentThread:main: - Hello from background worker process, increment counter from 21810 to 21811
     <INFO> 01-Jul-2019::21:22:03.859 bgworker ComponentThread:main: - Hello from background worker process, increment counter from 21811 to 21812
     <INFO> 01-Jul-2019::21:22:04.873 bgworker ComponentThread:main: - Hello from background worker process, increment counter from 21812 to 21813
     <INFO> 01-Jul-2019::21:22:05.880 bgworker ComponentThread:main: - Hello from background worker process, increment counter from 21813 to 21814
     <INFO> 01-Jul-2019::21:22:06.898 bgworker ComponentThread:main: - Hello from background worker process, increment counter from 21814 to 21815

     ==> ncs-python-vm.log <==
     <INFO> 1-Jul-2019::21:22:06.899 nuc ncs[11832]: bgworker :: Process Process-1:
     Traceback (most recent call last):
       File "/usr/lib/python2.7/multiprocessing/process.py", line 267, in _bootstrap
     <INFO> 1-Jul-2019::21:22:06.899 nuc ncs[11832]: bgworker ::     self.run()
       File "/usr/lib/python2.7/multiprocessing/process.py", line 114, in run
         self._target(*self._args, **self._kwargs)
       File "/home/kll/ncs-4.7.4.2/ncs-run/state/packages-in-use/1/bgworker/python/bgworker/main.py", line 19, in bg_worker
         raise ValueError("bad dice value")
     ValueError: bad dice value
     ^C
   #+END_SRC
    
   Lo and behold, it did. After this, nothing more happens as our process is dead. If we want the process restarted, we are going to have to do it ourselves. First, we need to monitor for liveness of the process and take action based on that... but before we do that, let's think through some other things that might happen and which we should react to.
    
** Reacting to configuration events
   Since you are reading this you probably haven't implemented a background worker yet so let me share some advice - add an *off* button. When you are troubleshooting your system it can be rather difficult with lots of things going on, triggered by these background workers. Having multiple background workers both of different type and multiple instances of the same type exacerbate the issue. With an off button we can easily turn them off and troubleshoot the interesting parts. It might seem crude, and I think it is, but in lack of better instrumentation in NCS, it is the best we have.
    
   The most intuitive way of doing this, and the way I've done it so far, is to simply add some configuration that controls whether the background worker is enabled or not. Going back to our YANG model, we add an ~enabled~ leaf to control if the worker is enabled or not.
    
   #+BEGIN_SRC yang
     module bgworker {

       namespace "http://example.com/bgworker";
       prefix bgworker;

       container bgworker {
         leaf enabled {
           type boolean;
           default true;
         }

         leaf counter {
           config false;
           type uint32;
           default 0;
         }
       }
     }
   #+END_SRC
    
