posts/2019-07-02-writing-a-background-worker-for-cisco-nso.org
** Reacting to HA events
   Finally, we have to react to High Availability (HA) events. Depending on which type of worker we are implementing we might want different behaviour. I've so far only had to deal with background workers that write configuration and since that can only be done on the master of a HA system, our background worker should only run on the master node. If you on the other hand are operating on some other data or perhaps not writing anything to CDB, it is possible to still run the worker on all nodes.
    
   Assuming you only want to run on the HA master we have to determine;
   - if HA is enabled
   - what the HA mode is
    
   Getting HA mode is quite simple, it's available from ~/ncs:ncs-state/ha/mode~.

   I wrote this simple decision algorithm for the behaviour we are looking for:
    
   | HA enabled | mode   | run worker? |
   |------------+--------+-------------|
   | enabled    | master | true        |
   | enabled    | slave  | false       |
   | enabled    | none   | false       |
   | disabled   | none   | true        |

   The sort of tricky thing is that when we are in mode ~none~ we should either run or not depending on if the whole HA functionality is enabled or not, which means we need to look at both. ~/ncs:ncs-state/ha~ is a presence container and is only present when HA is enabled, thus allowing us to determine if HA is enabled or not.
    
   Another problem around HA event monitoring is that the ~/ncs:ncs-state/ha~ path isn't in CDB oper as one might have thought, it is actually data provider (DP) backed meaning that we can't use the CDB subscriber design pattern to listen to events. Instead there is a new API that was introduced with NCS 4.7.3 that allows us to subscribe to various events. I'm not sure how I feel about this because one of the strengths of NCS was the YANG modeled nature of everything and that's been effectively abandoned here in benefit of some other interfaces. I've written code that repetitively reads from the ~/ncs:ncs-state/ha~ path but as it turns out, it's not very fast, probably due to the DP simply not being very fast. We should avoid hammering this path with reads and instead try to subscribe to changes.
    
