2019-07-25-writing-a-background-worker-for-cisco-nso.html

<div id="outline-container-org4e43f6e" class="outline-3">
<h3 id="org4e43f6e"><span class="section-number-3">1.9</span> Reacting to HA events</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Finally, we have to react to High Availability (HA) events. Depending on which type of worker we are implementing we might want different behaviour. I've so far only had to deal with background workers that write configuration and since that can only be done on the master of a HA system, our background worker should only run on the master node. If you on the other hand are operating on some other data or perhaps not writing anything to CDB, it is possible to still run the worker on all nodes.
</p>

<p>
Assuming you only want to run on the HA master we have to determine;
</p>
<ul class="org-ul">
<li>if HA is enabled</li>
<li>what the HA mode is</li>
</ul>

<p>
Getting HA mode is quite simple, it's available from <code>/ncs:ncs-state/ha/mode</code>.
</p>

<p>
I wrote this simple decision table for the behaviour we are looking for:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">HA enabled</th>
<th scope="col" class="org-left">mode</th>
<th scope="col" class="org-left">run worker?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">enabled</td>
<td class="org-left">master</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left">enabled</td>
<td class="org-left">slave</td>
<td class="org-left">false</td>
</tr>

<tr>
<td class="org-left">enabled</td>
<td class="org-left">none</td>
<td class="org-left">false</td>
</tr>

<tr>
<td class="org-left">disabled</td>
<td class="org-left">none</td>
<td class="org-left">true</td>
</tr>
</tbody>
</table>

<p>
The sort of tricky thing is that when we are in mode <code>none</code> we should either run or not depending on if the whole HA functionality is enabled or not, which means we need to look at both. <code>/ncs:ncs-state/ha</code> is a presence container and is only present when HA is enabled, thus allowing us to determine if HA is enabled or not.
</p>

<p>
Another problem around HA event monitoring is that the <code>/ncs:ncs-state/ha</code> path isn't in CDB oper as one might have thought, it is actually data provider (DP) backed meaning that we can't use the CDB subscriber design pattern to listen to events. Instead there is a new API that was introduced with NCS 4.7.3 that allows us to subscribe to various events. I'm not sure how I feel about this because one of the strengths of NCS was the YANG modeled nature of everything and that's been effectively abandoned here in benefit of some other interfaces. I've written code that repetitively reads from the <code>/ncs:ncs-state/ha</code> path but as it turns out, it's not very fast, probably due to the DP simply not being very fast. We should avoid hammering this path with reads and instead try to subscribe to changes.
</p>
</div>
</div>
